Revit 2024 API
Element.EvaluateParameterValues Method
 Evaluate the parameters' values of the element on the given parameter ID set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public IList<EvaluatedParameter> EvaluateParameterValues(
	ISet<ElementId> parameterIds
)
Visual Basic
Public Function EvaluateParameterValues ( _
	parameterIds As ISet(Of ElementId) _
) As IList(Of EvaluatedParameter)
Visual C++
public:
IList<EvaluatedParameter^>^ EvaluateParameterValues(
	ISet<ElementId^>^ parameterIds
)
Parameters
parameterIds
Type: System.Collections.Generic.ISet<ElementId>
 Parameter IDs with which the ParameterValue to be retrieved.
Return Value
 List of EvaluatedParameter of the element, which does not include those that cannot be retrieved but are passed in through parameterIds.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
Element Class
Autodesk.Revit.DB Namespace